# Data Aquisition

In [1]:
# Practical No:2

In [2]:
#Aim:To Perform Operation Of Data Acquisition Using Pandas

In [1]:
#Name:Punam S.Somkuwar
#Roll NO.:64
#Sec:3C
#Subject:ET-1 
#Date:19/07/2024

In [4]:
import pandas as pd

In [5]:
import os

In [6]:
os.getcwd()

'C:\\Users\\nikhi'

In [7]:
os.chdir("C:\\Users\\nikhi\\Desktop")

In [8]:
data=pd.read_csv("salary.csv")

In [9]:
data.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [10]:
data.tail()

    YearsExperience  Salary
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [11]:
data.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000